# TAPS

# The `brew bundle` command
tap "homebrew/bundle"
# Homebrew cask formulae for Nerd Fonts
tap "homebrew/cask-fonts"
# Homebrew cask formulae for Zulu JDK
tap "homebrew/cask-versions"
# Formulae for 1Password CLI
tap "1password/tap"
# Formulae for bottom
tap "ClementTsang/bottom"
# Formulae for sshpass
tap "esolitos/ipa"
# Formulae for webfont-related tools
tap "bramstein/webfonttools"
# Formulae for WezTerm
tap "wez/wezterm"

# BINARIES

# GNU utilities, to replace default BSD ones
brew "coreutils"
brew "findutils"
brew "grep"
brew "make"
brew "gnu-sed"
brew "stow"

# Get latest version of the OpenSSH utilities
# Disabled to not mess with Keychain integration
# brew "openssh"
# brew "ssh-copy-id"
brew "sshpass"

# The `wget` command
brew "wget"

# Other miscellaneous binaries
brew "ack"
brew "atuin"  # Rust
brew "bat"    # Rust
brew "bottom" # Rust
brew "graphviz"
brew "imagemagick"
brew "jq"
brew "less"
brew "mackup"    # Python
brew "mas"       # Swift
brew "mitmproxy" # Python
brew "mkcert"    # Golang
brew "neofetch"
brew "p7zip"
brew "pigz"
brew "pkg-config"
brew "protobuf" # Python
brew "readline"
brew "sqlmap"
brew "tealdeer" # Rust
brew "tree"
brew "xz"
brew "yq" # Golang
brew "zlib"
brew "zopfli"

# General development tools
brew "cmake"
brew "gh" # Golang
brew "git"
brew "git-absorb" # Rust
brew "nginx"
brew "shellcheck"
brew "terraform"
brew "watchman" # Python

# Database related tools
brew "postgresql@15"
brew "sqlite"

# Docker related tools
brew "hadolint"       # Haskell
brew "helm"           # Golang
brew "k9s"            # Golang
brew "kubernetes-cli" # Golang
brew "kustomize"      # Golang
brew "minikube"       # Golang

# Node.js related tools
brew "fnm"

# Go related tools
brew "goenv"

# Python related tools
brew "pipx"
brew "pyenv"

# Ruby related tools
brew "rbenv"

# Rust related tools
brew "rustup-init" # Rust

# Swift related tools
brew "cocoapods"

# Tools to optimise images
brew "jpegoptim"
brew "pngquant" # Rust
brew "optipng"

# Tools to generate webfonts
brew "sfnt2woff"
brew "sfnt2woff-zopfli"
brew "woff2"

# CASKS

# Binaries and Drivers
cask "google-cloud-sdk"
cask "zulu17"

# Browsers
cask "firefox"
cask "google-chrome"
cask "microsoft-edge"

# Utilities
cask "1password"
cask "1password-cli"
cask "craft"
cask "karabiner-elements"
cask "linear-linear"
cask "logi-options-plus"
cask "microsoft-auto-update"
cask "microsoft-excel"
cask "mimestream"
cask "morgen"
cask "mullvadvpn"
cask "raycast"
cask "setapp"
cask "splashtop-business"
cask "the-unarchiver"
cask "yubico-yubikey-manager"

# IM
cask "slack"
cask "telegram-desktop"

# Creative and Design
cask "figma"
cask "font-meslo-lg-nerd-font"
cask "sf-symbols"

# Development
cask "codewhisperer"
cask "dash"
cask "docker"
cask "flipper"
cask "gpg-suite"
cask "imageoptim"
cask "jetbrains-toolbox"
cask "ngrok"
cask "orbstack"
cask "swiftformat-for-xcode"
cask "visual-studio-code"
cask "wezterm"

# Mobile
cask "vysor"

# MAC APPSTORE APPS

mas "Magnet", id: 441258766
mas "Speedtest by Ookla", id: 1153157709
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
